InformationRegisters/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыДоверенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоверенностьОформлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверенностьОтозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СмертьДоверителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СмертьДоверенногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеПрекращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверенностьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеПрекращеноЗаймВыкуплен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийДоверенность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийДоверенность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отзыв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДоверенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нотариальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письменная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОСмерти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<BasedOn>
				<xr:Item>Document.ЛБ_ОперацияПоЗалогу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_Доверенности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзываемаяДоверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителяКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОНотариуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ЛБ_Доверенности/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
	КонецЕсли; 
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;   
		ДатаСмерти = ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Клиент, ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		Сообщить("Не выбран залоговый билет!");
		Отказ = Истина;  
	Иначе          
		СтатусЗалоговогоБилета = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
		ОбновитьТаблицу();
	КонецЕсли;
	ЭтаФорма.Заголовок = "Доверенности по залоговому билету № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + " доверитель " + СокрЛП(Клиент);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицу()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность.ВидДоверенности КАК ВидДоверенности,
	               |	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
	               |	НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы,
	               |	ЛБ_ДоверенностиСрезПоследних.ВидОперации КАК ВидОперации
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ДоверенностиСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	               |		ПО ЛБ_ДоверенностиСрезПоследних.Доверенность = НаличиеФайлов.ОбъектСФайлами
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДоверенностиСрезПоследних.Период
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДоверенностей.Загрузить(ТаблицаЗапроса);  
	Для каждого Стр Из ТаблицаДоверенностей Цикл
		Если Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Если  Стр.Доверенность.СрокДействияДоверенности >= НачалоДня(ТекущаяДата()) Тогда 
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.Клиент, ТекущаяДата()) = неопределено Тогда  
					Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверителя;  
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.ПредставительКлиента, ТекущаяДата()) = неопределено Тогда  
					Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;	
				Иначе	
				    Стр.Действует = Истина;  
				КонецЕсли;	
			ИначеЕсли Стр.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.ПредставительКлиента, ТекущаяДата()) = неопределено Тогда  
					Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;	
				Иначе	
				    Стр.Действует = Истина; 
				КонецЕсли;	
			Иначе	
				Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращено;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда) 
	Если СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Закрыт") Тогда 
		Сообщить("Нельзя создавать доверенности по закрытому залоговому билету.");
		Возврат;
	КонецЕсли;	         
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗалоговыйБилет",  ЗалоговыйБилет);
	ПараметрыФормы.Вставить("Клиент",  Клиент);   
	Если ЗначениеЗаполнено(ДатаСмерти) Тогда 
		ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Наследство"));
	Иначе	
	    ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление"));
	КонецЕсли;	

    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияДоверенности",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеДобавленияДоверенности(Результат, ДопПараметры) Экспорт
	ОбновитьТаблицу(); 
	Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
        ФормаРМП = ВладелецФормы;  
		Если ФормаРМП.Залогодатель = Клиент Тогда
            ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Анулировать(Команда)  
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда
		Если НЕ ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление") Тогда
			Возврат;
		КонецЕсли;	

		СписокВыбора = Новый СписокЗначений; 		
		СписокВыбора.Добавить("Отзыв", "Отзыв доверенности"); 
		СписокВыбора.Добавить("Ошибка", "Ошибка"); 

		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.ТаблицаДоверенностей.ТекущаяСтрока); 
		
		Если НЕ ВыбранноеЗначение = неопределено Тогда 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Доверенность",  ТекСтрока.Доверенность);  
			Если ВыбранноеЗначение.Значение = "Отзыв" Тогда
			    ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Отзыв"));
			Иначе
				ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Ошибка")); 
			КонецЕсли;	

		    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияДоверенности",ЭтаФорма);
			ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено И ТекСтрока.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", ?(ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление"), "Доверенность", "ДоверенностьОтмена")); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Доверенности");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.Доверенность);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);  
	КонецЕсли;	
КонецПроцедуры
	

&НаКлиенте
Процедура ПрисединитьСкан(Команда)  
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;  
	//Если НЕ ТекСтрока = неопределено И ТекСтрока.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  ТекСтрока.Доверенность);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ложь);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеПрисоединенияСкана",ЭтаФорма);

		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.Независимый);
	//КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеПрисоединенияСкана(Результат, ДопПараметры) Экспорт
	ОбновитьТаблицу();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДоверенностейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда
		СсылкаНаЭлемент = ТекСтрока.Доверенность;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлемент);
		ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьИсториюДоверенности(ИдентификаторСтроки)
	СтрокаТаблицы = ТаблицаДоверенностей.НайтиПоИдентификатору(ИдентификаторСтроки);
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Доверенность", СтрокаТаблицы.Доверенность);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Доверенности.Период КАК Период,
	               |	ЛБ_Доверенности.Ответственный КАК Ответственный,
	               |	ЛБ_Доверенности.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности КАК ЛБ_Доверенности
	               |ГДЕ
	               |	ЛБ_Доверенности.Доверенность = &Доверенность
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = "";
	Пока Выборка.Следующий() Цикл 
		 Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + Формат(Выборка.Период, "ДЛФ=DDT") + " " + Строка(Выборка.СтатусДоверенности);
		 Если Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена ИЛИ 
			  Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОтозвана ИЛИ
			  Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОшибка Тогда 
		     Результат = Результат + " " + СокрЛП(Выборка.Ответственный);
		 ИначеЕсли Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращено Тогда
			 Результат = Результат + " (закрытие залоговог билета)";
		 КонецЕсли;  
	 КонецЦикла;	 
	 Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ТаблицаДоверенностейПриАктивизацииСтроки(Элемент) 
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ИсторияДоверенности = ПолучитьИсториюДоверенности(ИдентификаторСтроки); 
	КонецЕсли;	
КонецПроцедуры
